name: "resnet50_config_2"
platform: "pytorch_libtorch"
max_batch_size: 1
input {
  name: "INPUT__0"
  data_type: TYPE_FP32
  dims: 3
  dims: 224
  dims: 224
}
output {
  name: "OUTPUT__0"
  data_type: TYPE_FP32
  dims: 1000
  label_filename: "labels.txt"
}
instance_group {
  count: 1
  kind: KIND_GPU
}
dynamic_batching {
}
