name: "resnet50_config_8"
platform: "pytorch_libtorch"
max_batch_size: 128
input {
  name: "INPUT__0"
  data_type: TYPE_FP32
  dims: 3
  dims: 224
  dims: 224
}
output {
  name: "OUTPUT__0"
  data_type: TYPE_FP32
  dims: 1000
  label_filename: "labels.txt"
}
instance_group {
  count: 3
  gpus: 0
  kind: KIND_GPU
}
dynamic_batching {
  max_queue_delay_microseconds: 200
}
