name: "densenet_onnx_config_1"
platform: "onnxruntime_onnx"
version_policy {
  latest {
    num_versions: 1
  }
}
input {
  name: "data_0"
  data_type: TYPE_FP32
  dims: 1
  dims: 3
  dims: 224
  dims: 224
}
output {
  name: "fc6_1"
  data_type: TYPE_FP32
  dims: 1
  dims: 1000
  dims: 1
  dims: 1
}
instance_group {
  count: 2
  kind: KIND_GPU
}
default_model_filename: "model.onnx"
optimization {
  input_pinned_memory {
    enable: true
  }
  output_pinned_memory {
    enable: true
  }
}
backend: "onnxruntime"
